"use strict";
import { gsap } from "gsap";
    
import { ScrollTrigger } from "gsap/ScrollTrigger";
import { ScrollToPlugin } from "gsap/ScrollToPlugin";

/* The following plugin is a Club GSAP perk */
import { SplitText } from "gsap/SplitText";
gsap.registerPlugin(ScrollTrigger,ScrollToPlugin,SplitText);


// 路径数据
    const paths = [
        "M20.57,294.73c14.25,5.58,74.76,21.07,68.4,43.01-24.97,86.09,23.44,49.34,77.63,34.53,40.06-10.95,26.66,26.24,67.15,16.76,32.01-7.49,29.73-54.56,93.05-39.87,31.62,7.33,22.05,47.96,68.8,42.28,58.57-7.12,22.88-42.14,66.56-55.93,56.06-17.7,56.4,10.65,73.11,13.73,51.69,9.52,66.97-34.9,84.76-43.41,67.74-32.4,36.24-60.96,24.15-79.84-15.68-24.51,19.72-30.77,12.6-49.91-13.27-35.66-23.81-12.44-56.62-33.66-35.81-23.17,40.49-46.4-3.8-71.69-41.67-23.79-98.67,10.56-103.18.09-7.52-17.46,5.89-40.27-71.58-3.23-4.03,1.93-33.66-58.68-78.15-64.76-53.73-7.34-44.68,83.8-89.86,88.18-33.58,3.26-40.78-49.1-110.14-11.65-31.6,17.06-36.55,71.42-58.29,64.71C2.5,118.58-16.58,280.18,20.57,294.73Z", // 第一个形状
        "M20.33,271.1c17.4-2.12,76.12,14.11,69.75,36.05-24.97,86.09,16.2,40.08,65.73,42.95,41.46,2.4,20.29,6.13,61.87,6.13,33.97,0,32.17-28.82,97.12-26.17,28.48,1.16,33.9,31.85,80.65,26.17,58.57-7.12,17.39-38.56,61.07-52.35,56.06-17.7,61.8,11.18,78.52,14.18,49.19,8.83,29.04-21.14,70.2-35.17,54.03-18.42,43.31-46.29,31.23-65.17-15.68-24.51,23.59-27.79,20.72-52.35-5.89-50.47-21.06-17.83-53.95-39.21-35.76-23.25,22.99-44.56-21.3-69.85-41.67-23.79-74.38,9.76-81.8,1.09-12.8-14.96-5.3-47.12-82.77-10.08-4.03,1.93-56.03-56.06-98.99-42.98-37.66,11.46-33.23,67.01-61.07,66.6-33.73-.5-32.36-25.01-97.45-3.72-34.13,11.16-67.09,77.37-89.43,73.07C4.55,127.6-16.26,275.55,20.33,271.1Z", // 第一个形状
        "M18.82,313.84c13.26,7.65,73.49-9.29,67.13,12.65-24.97,86.09,21.53,29.77,71.06,32.64,41.46,2.4,52.53,31.06,94.11,31.05,35.24,0,24.22-61.61,62.17-58.89,28.43,2.03,33.57,49.9,80.31,44.22,58.57-7.12,25.86-18.98,69.54-32.77,56.06-17.7,63.24-13.11,79.97-10.11,49.19,8.83,42.18-1.49,83.34-15.52,54.03-18.42,21.75-73.82,9.67-92.7-15.68-24.51,22.5-43.06,19.63-67.62-5.89-50.47-25.71-4.24-58.6-25.62-35.76-23.25,61.45-41.8,17.16-67.09-41.67-23.79-119.63,5.96-124.14-4.51-7.52-17.46,5.89-40.27-71.58-3.23-4.03,1.93-14.34-65.32-57.3-52.25-37.66,11.46-74.92,76.28-102.75,75.87-33.73-.5-30.66-19.72-95.74,1.57-34.13,11.16-73.63,44.65-95.97,40.35C.91,109.21-13.11,295.42,18.82,313.84Z", // 第二个形状
        "M15.29,308.5c13.26,7.65,73.49-9.29,67.13,12.65-24.97,86.09,22.47,42.38,72,45.24,41.46,2.4,51.59,18.45,93.18,18.45,35.24,0,30.66-38.63,68.6-35.91,28.43,2.03,27.13,26.92,73.88,21.24,58.57-7.12,25.86-18.98,69.54-32.77,56.06-17.7,63.24-13.11,79.97-10.11,49.19,8.83,49.82,17.29,90.98,3.26,54.03-18.42,29.54-95.1,17.46-113.98-15.68-24.51,7.06-40.56,4.2-65.12-5.89-50.47-25.71-4.24-58.6-25.62-35.76-23.25,41.51-48.47-2.78-73.75-41.67-23.79-95.19,23.11-99.7,12.63-7.52-17.46,1.38-50.74-76.09-13.7-4.03,1.93-32.92-59.85-75.87-46.78-37.66,11.46-61.33,59.24-89.16,58.83-33.73-.5-53.49-15.77-118.57,5.52-34.13,11.16-30.05,57.61-52.39,53.31C13.14,109.2-16.64,290.08,15.29,308.5Z", // 第三个形状
        
        ];

        let currentIndex = 0;

    function animatePath() {
        gsap.to(".path", {
        attr: {d: paths[currentIndex]}, // 改变 d 属性
        duration: 2, // 动画持续时间
        ease: "power2.inOut", // 缓动函数
        onComplete: () => {
        // 循环到下一个路径
        currentIndex = (currentIndex + 1) % paths.length;
        animatePath(); // 递归调用实现循环
        }
        });
    }

    animatePath(); // 开始动画

// 图片移动动画
        gsap.to("#fv_alien", {
            x: 30, // 横向移动距离
            duration: 2, // 动画持续时间
            ease: "power1.inOut", // 缓动效果
            repeat: -1, // 重复次数，-1 为无限循环
            yoyo: true, // 开启往返动画
            repeatDelay: 2 // 每次动画完成后延迟2秒再开始下一次循环
        });
        gsap.to("#fv_ufo", {
            y: -20, // 纵向移动距离
            duration: 1, // 动画持续时间
            ease: "power1.inOut", // 缓动效果
            repeat: -1, // 重复次数，-1 为无限循环
            yoyo: true // 开启往返动画
        });

// 地球旋转动画
        gsap.to("#earth", {
            rotation: 360, // 旋转360度
            duration: 10, // 持续时间，这里假设是10秒完成一圈
            ease: "none", // 线性动画，无缓动效果
            repeat: -1 // 无限重复
        });

// 飞出去的动画
        gsap.to("#rockets", {
            delay: 3,  // 延迟3秒开始动画
            x: window.innerWidth,
            y: -window.innerHeight,
            duration: 4,  // 减少飞行时间为4秒，稍微加快速度
            ease: "power1.in",
            onComplete: () => {
                // 渐隐消失
                gsap.to("#rockets", { opacity: 0, duration: 0.5, onComplete: () => {
                    // 重置位置并延迟3秒后开始渐显
                    gsap.set("#rockets", { x: 0, y: 0, opacity: 0 });  // 使用 set 来立即重置位置而不产生动画效果
                    gsap.to("#rockets", { 
                        opacity: 1, 
                        duration: 0.5, 
                        delay: 3  // 飞出去后延迟3秒再开始渐显
                    });
                }});
            }
        });

// 文字动画
document.addEventListener('DOMContentLoaded', function () {
    // 选择所有具有 'reveal-type' 类的元素
    const revealTypes = document.querySelectorAll('.reveal-type');

    revealTypes.forEach((char) => {
        // 在文本上初始化 SplitText，将其分割为单独的字符以便进行个别动画
        const text = new SplitText(char, { type: 'chars' });

        // 使用 GSAP 从初始状态到最终状态进行动画设置，当元素进入视口时开始动画
        gsap.fromTo(text.chars, {
            color: 'transparent', // 开始时文字颜色透明
            webkitTextStroke: '1px #cccccc' // 初始文字描边
        }, {
            color: '#3B3532', // 结束时使用您的 SCSS 中定义的字体颜色
            webkitTextStroke: '0px transparent', // 结束时无文字描边
            duration: 0.3,
            stagger: 0.02,
            scrollTrigger: {
                trigger: char,
                start: 'top 80%', // 当元素顶部距视口顶部 80% 时开始动画
                end: 'top 20%', // 当元素顶部距视口顶部 20% 时结束动画
                scrub: true,
                toggleActions: 'play play reverse reverse'
            }
        });
    });

    // 初始化平滑滚动（假设您正在使用 Lenis 进行平滑滚动）
    const lenis = new Lenis({
        lerp: 0.1 // 平滑滚动强度，根据需要调整
    });

    // 处理每个动画帧
    function raf(time) {
        lenis.raf(time); // 在每个动画帧更新 Lenis
        requestAnimationFrame(raf); // 继续动画帧循环
    }

    // 开始动画帧循环
    requestAnimationFrame(raf);
});

